controllers/interactuar-afip-wsaa/plantillas-facturas/xml/C.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ar="http://ar.gov.afip.dif.FEV1/">
    <soapenv:Header/>
    <soapenv:Body>
        <ar:FECAESolicitar>
            <ar:Auth>
                <ar:Token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iODc5NDI5MTkwIiBnZW5fdGltZT0iMTc0OTQwOTE3MSIgZXhwX3RpbWU9IjE3NDk0NTI0MzEiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NmZSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDQzNzgxMzcwMiwgQ049ZWplbXBvdGVzdGluIiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjA0Mzc4MTM3MDIiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmFhdGlvbj4KPC9zcw+K</ar:Token>
                <ar:Sign>C4ZlOmNLkwHUbiGMyGLbS/1MEu2ycu7gI35Fp8n6dz4INxtzPXEnSe/qjPFrz/lZ06D5bpY9vGWjTSv4N1QhxrHoYcJAgarJxFoyoE/1zxXRDQLlAc6Gl7jWoGGsxawwMuN20k/VGOPt1IhECUkhkh6/LckzlWlrtu+Fp5BBY4I=</ar:Sign>
                <ar:Cuit>20437813702</ar:Cuit>
            </ar:Auth>
            <ar:FeCAEReq>
                <ar:FeCabReq>
                    <ar:CantReg>1</ar:CantReg>
                    <ar:PtoVta>12</ar:PtoVta>
                    <ar:CbteTipo>6</ar:CbteTipo>
                </ar:FeCabReq>
                <ar:FeDetReq>
                    <ar:FECAEDetRequest>
                        <ar:Concepto>1</ar:Concepto>
                        <ar:DocTipo>99</ar:DocTipo>
                        <ar:DocNro>0</ar:DocNro>
                        <ar:CbteDesde>50</ar:CbteDesde>
                        <ar:CbteHasta>50</ar:CbteHasta>
                        <ar:CbteFch>20250609</ar:CbteFch>
                        <ar:ImpTotal>121.00</ar:ImpTotal>
                        <ar:ImpTotConc>0</ar:ImpTotConc>
                        <ar:ImpNeto>100.00</ar:ImpNeto>
                        <ar:ImpOpEx>0</ar:ImpOpEx>
                        <ar:ImpTrib>0</ar:ImpTrib>
                        <ar:ImpIVA>0.00</ar:ImpIVA>
                        <ar:FchServDesde></ar:FchServDesde>
                        <ar:FchServHasta></ar:FchServHasta>
                        <ar:FchVtoPago></ar:FchVtoPago>
                        <ar:MonId>PES</ar:MonId>
                        <ar:MonCotiz>1</ar:MonCotiz>
                        <ar:CondicionIVAReceptorId>4</ar:CondicionIVAReceptorId>
                        <ar:Tributos></ar:Tributos>
                        <ar:Iva></ar:Iva>
                    </ar:FECAEDetRequest>
                </ar:FeDetReq>
            </ar:FeCAEReq>
        </ar:FECAESolicitar>
    </soapenv:Body>
</soapenv:Envelope>